## Sales Analysis

#### Import Neccessary Libraries

In [5]:
import pandas as pd
import os

#### Task #1: Merge the 12 months of sales data into a single CSV file

In [8]:
# loading data; df= data frame

df =pd.read_csv("./Sales_Data/Sales_April_2019.csv")

# list all CSV files
files = [file for file in os.listdir('./Sales_Data')]

all_months_data = pd.DataFrame()


# concatetory 
for file in files:
    df = pd.read_csv("./Sales_Data/"+file)
    all_months_data = pd.concat([all_months_data, df])
    
#save the merged data to a new CSV file
all_months_data.to_csv("all_data.csv", index=False)

#### Read in updated dataframe

In [9]:
all_data = pd.read_csv("all_data.csv")
all_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,295665,Macbook Pro Laptop,1,1700,12/30/19 00:01,"136 Church St, New York City, NY 10001"
1,295666,LG Washing Machine,1,600.0,12/29/19 07:03,"562 2nd St, New York City, NY 10001"
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001"
3,295668,27in FHD Monitor,1,149.99,12/22/19 15:13,"410 6th St, San Francisco, CA 94016"
4,295669,USB-C Charging Cable,1,11.95,12/18/19 12:38,"43 Hill St, Atlanta, GA 30301"

### Clean up the data!

##### *Drop rows NaN*

In [16]:
nan_df = all_data[all_data.isna().any(axis=1)]
nan_df.head()

all_data = all_data.dropna()

### Add a Month column
- show all columns and add a **month column** 
- then find out what **error** with the dataframe 
- back to clean data

#### Question 1: What was the best month for sales? How much was earned that month?